[M_WinterIsComing MissionDefinition]
MissionDescription="Roland wants you to take care of an evil prince named Jeffrey. In this context, however, ''take care of'' doesn't actually mean ''kill'' -- Roland just wants you to find Jeffrey, kill his guards, and slap him around until he stops acting like such a jerk."
TeaserText="This all sounds so familiar..."

[M_WinterIsComing:WIC_KillJefferysGuards MissionObjectiveDefinition]
ProgressMessage="Kill Jeffrey's guards"

[M_WinterIsComing:WIC_OS_TalkToAristocrat MissionObjectiveSetDefinition]
MissionDescriptionOverride="Roland wants you to take care of an evil prince named Jeffrey. In this context, however, ''take care of'' doesn't actually mean ''kill'' -- Roland just wants you to find Jeffrey, kill his guards, and slap him around until he stops acting like such a jerk.<br>You disarmed and slapped Jeffrey a few times. If you so wish, however, you can continue to slap the jerkbag around at your leisure. Additionally, a stuffy aristocrat has suddenly appeared. You can also chat with him, if you like."
